MikroElektronika/core_packages/PIC/XC8/def/PIC18F47K42/mcu.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x3996);
#ifndef _LIB_BUILD
asm("PIE6 equ 03996h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IE                 :1;
        unsigned I2C2EIE                :1;
        unsigned U2RXIE                 :1;
        unsigned U2TXIE                 :1;
        unsigned U2EIE                  :1;
        unsigned U2IE                   :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x3996);
// bitfield macros
#define _PIE6_I2C2IE_POSN                                   0x0
#define _PIE6_I2C2IE_POSITION                               0x0
#define _PIE6_I2C2IE_SIZE                                   0x1
#define _PIE6_I2C2IE_LENGTH                                 0x1
#define _PIE6_I2C2IE_MASK                                   0x1
#define _PIE6_I2C2EIE_POSN                                  0x1
#define _PIE6_I2C2EIE_POSITION                              0x1
#define _PIE6_I2C2EIE_SIZE                                  0x1
#define _PIE6_I2C2EIE_LENGTH                                0x1
#define _PIE6_I2C2EIE_MASK                                  0x2
#define _PIE6_U2RXIE_POSN                                   0x2
#define _PIE6_U2RXIE_POSITION                               0x2
#define _PIE6_U2RXIE_SIZE                                   0x1
#define _PIE6_U2RXIE_LENGTH                                 0x1
#define _PIE6_U2RXIE_MASK                                   0x4
#define _PIE6_U2TXIE_POSN                                   0x3
#define _PIE6_U2TXIE_POSITION                               0x3
#define _PIE6_U2TXIE_SIZE                                   0x1
#define _PIE6_U2TXIE_LENGTH                                 0x1
#define _PIE6_U2TXIE_MASK                                   0x8
#define _PIE6_U2EIE_POSN                                    0x4
#define _PIE6_U2EIE_POSITION                                0x4
#define _PIE6_U2EIE_SIZE                                    0x1
#define _PIE6_U2EIE_LENGTH                                  0x1
#define _PIE6_U2EIE_MASK                                    0x10
#define _PIE6_U2IE_POSN                                     0x5
#define _PIE6_U2IE_POSITION                                 0x5
#define _PIE6_U2IE_SIZE                                     0x1
#define _PIE6_U2IE_LENGTH                                   0x1
#define _PIE6_U2IE_MASK                                     0x20
#define _PIE6_TMR3IE_POSN                                   0x6
#define _PIE6_TMR3IE_POSITION                               0x6
#define _PIE6_TMR3IE_SIZE                                   0x1
#define _PIE6_TMR3IE_LENGTH                                 0x1
#define _PIE6_TMR3IE_MASK                                   0x40
#define _PIE6_TMR3GIE_POSN                                  0x7
#define _PIE6_TMR3GIE_POSITION                              0x7
#define _PIE6_TMR3GIE_SIZE                                  0x1
#define _PIE6_TMR3GIE_LENGTH                                0x1
#define _PIE6_TMR3GIE_MASK                                  0x80

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x3997);
#ifndef _LIB_BUILD
asm("PIE7 equ 03997h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned                        :1;
        unsigned CWG2IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned INT2IE                 :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x3997);
// bitfield macros
#define _PIE7_TMR4IE_POSN                                   0x0
#define _PIE7_TMR4IE_POSITION                               0x0
#define _PIE7_TMR4IE_SIZE                                   0x1
#define _PIE7_TMR4IE_LENGTH                                 0x1
#define _PIE7_TMR4IE_MASK                                   0x1
#define _PIE7_CCP2IE_POSN                                   0x1
#define _PIE7_CCP2IE_POSITION                               0x1
#define _PIE7_CCP2IE_SIZE                                   0x1
#define _PIE7_CCP2IE_LENGTH                                 0x1
#define _PIE7_CCP2IE_MASK                                   0x2
#define _PIE7_CWG2IE_POSN                                   0x3
#define _PIE7_CWG2IE_POSITION                               0x3
#define _PIE7_CWG2IE_SIZE                                   0x1
#define _PIE7_CWG2IE_LENGTH                                 0x1
#define _PIE7_CWG2IE_MASK                                   0x8
#define _PIE7_CLC2IE_POSN                                   0x4
#define _PIE7_CLC2IE_POSITION                               0x4
#define _PIE7_CLC2IE_SIZE                                   0x1
#define _PIE7_CLC2IE_LENGTH                                 0x1
#define _PIE7_CLC2IE_MASK                                   0x10
#define _PIE7_INT2IE_POSN                                   0x5
#define _PIE7_INT2IE_POSITION                               0x5
#define _PIE7_INT2IE_SIZE                                   0x1
#define _PIE7_INT2IE_LENGTH                                 0x1
#define _PIE7_INT2IE_MASK                                   0x20

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x3998);
#ifndef _LIB_BUILD
asm("PIE8 equ 03998h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IE                 :1;
        unsigned TMR5GIE                :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x3998);
// bitfield macros
#define _PIE8_TMR5IE_POSN                                   0x6
#define _PIE8_TMR5IE_POSITION                               0x6
#define _PIE8_TMR5IE_SIZE                                   0x1
#define _PIE8_TMR5IE_LENGTH                                 0x1
#define _PIE8_TMR5IE_MASK                                   0x40
#define _PIE8_TMR5GIE_POSN                                  0x7
#define _PIE8_TMR5GIE_POSITION                              0x7
#define _PIE8_TMR5GIE_SIZE                                  0x1
#define _PIE8_TMR5GIE_LENGTH                                0x1
#define _PIE8_TMR5GIE_MASK                                  0x80

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0x3999);
#ifndef _LIB_BUILD
asm("PIE9 equ 03999h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IE                 :1;
        unsigned CCP3IE                 :1;
        unsigned CWG3IE                 :1;
        unsigned CLC3IE                 :1;
    };
} PIE9bits_t;
extern volatile PIE9bits_t PIE9bits __at(0x3999);
// bitfield macros
#define _PIE9_TMR6IE_POSN                                   0x0
#define _PIE9_TMR6IE_POSITION                               0x0
#define _PIE9_TMR6IE_SIZE                                   0x1
#define _PIE9_TMR6IE_LENGTH                                 0x1
#define _PIE9_TMR6IE_MASK                                   0x1
#define _PIE9_CCP3IE_POSN                                   0x1
#define _PIE9_CCP3IE_POSITION                               0x1
#define _PIE9_CCP3IE_SIZE                                   0x1
#define _PIE9_CCP3IE_LENGTH                                 0x1
#define _PIE9_CCP3IE_MASK                                   0x2
#define _PIE9_CWG3IE_POSN                                   0x2
#define _PIE9_CWG3IE_POSITION                               0x2
#define _PIE9_CWG3IE_SIZE                                   0x1
#define _PIE9_CWG3IE_LENGTH                                 0x1
#define _PIE9_CWG3IE_MASK                                   0x4
#define _PIE9_CLC3IE_POSN                                   0x3
#define _PIE9_CLC3IE_POSITION                               0x3
#define _PIE9_CLC3IE_SIZE                                   0x1
#define _PIE9_CLC3IE_LENGTH                                 0x1
#define _PIE9_CLC3IE_MASK                                   0x8

// Register: PIE10
#define PIE10 PIE10
extern volatile unsigned char           PIE10               __at(0x399A);
#ifndef _LIB_BUILD
asm("PIE10 equ 0399Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IE                 :1;
        unsigned CLC4IE                 :1;
    };
} PIE10bits_t;
