MikroElektronika/core_packages/PIC/XC8/def/PIC18F47K42/mcu.h
// Register: IOCCN
#define IOCCN IOCCN
extern volatile unsigned char           IOCCN               __at(0x3A66);
#ifndef _LIB_BUILD
asm("IOCCN equ 03A66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCN0                 :1;
        unsigned IOCCN1                 :1;
        unsigned IOCCN2                 :1;
        unsigned IOCCN3                 :1;
        unsigned IOCCN4                 :1;
        unsigned IOCCN5                 :1;
        unsigned IOCCN6                 :1;
        unsigned IOCCN7                 :1;
    };
} IOCCNbits_t;
extern volatile IOCCNbits_t IOCCNbits __at(0x3A66);
// bitfield macros
#define _IOCCN_IOCCN0_POSN                                  0x0
#define _IOCCN_IOCCN0_POSITION                              0x0
#define _IOCCN_IOCCN0_SIZE                                  0x1
#define _IOCCN_IOCCN0_LENGTH                                0x1
#define _IOCCN_IOCCN0_MASK                                  0x1
#define _IOCCN_IOCCN1_POSN                                  0x1
#define _IOCCN_IOCCN1_POSITION                              0x1
#define _IOCCN_IOCCN1_SIZE                                  0x1
#define _IOCCN_IOCCN1_LENGTH                                0x1
#define _IOCCN_IOCCN1_MASK                                  0x2
#define _IOCCN_IOCCN2_POSN                                  0x2
#define _IOCCN_IOCCN2_POSITION                              0x2
#define _IOCCN_IOCCN2_SIZE                                  0x1
#define _IOCCN_IOCCN2_LENGTH                                0x1
#define _IOCCN_IOCCN2_MASK                                  0x4
#define _IOCCN_IOCCN3_POSN                                  0x3
#define _IOCCN_IOCCN3_POSITION                              0x3
#define _IOCCN_IOCCN3_SIZE                                  0x1
#define _IOCCN_IOCCN3_LENGTH                                0x1
#define _IOCCN_IOCCN3_MASK                                  0x8
#define _IOCCN_IOCCN4_POSN                                  0x4
#define _IOCCN_IOCCN4_POSITION                              0x4
#define _IOCCN_IOCCN4_SIZE                                  0x1
#define _IOCCN_IOCCN4_LENGTH                                0x1
#define _IOCCN_IOCCN4_MASK                                  0x10
#define _IOCCN_IOCCN5_POSN                                  0x5
#define _IOCCN_IOCCN5_POSITION                              0x5
#define _IOCCN_IOCCN5_SIZE                                  0x1
#define _IOCCN_IOCCN5_LENGTH                                0x1
#define _IOCCN_IOCCN5_MASK                                  0x20
#define _IOCCN_IOCCN6_POSN                                  0x6
#define _IOCCN_IOCCN6_POSITION                              0x6
#define _IOCCN_IOCCN6_SIZE                                  0x1
#define _IOCCN_IOCCN6_LENGTH                                0x1
#define _IOCCN_IOCCN6_MASK                                  0x40
#define _IOCCN_IOCCN7_POSN                                  0x7
#define _IOCCN_IOCCN7_POSITION                              0x7
#define _IOCCN_IOCCN7_SIZE                                  0x1
#define _IOCCN_IOCCN7_LENGTH                                0x1
#define _IOCCN_IOCCN7_MASK                                  0x80

// Register: IOCCF
#define IOCCF IOCCF
extern volatile unsigned char           IOCCF               __at(0x3A67);
#ifndef _LIB_BUILD
asm("IOCCF equ 03A67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCF0                 :1;
        unsigned IOCCF1                 :1;
        unsigned IOCCF2                 :1;
        unsigned IOCCF3                 :1;
        unsigned IOCCF4                 :1;
        unsigned IOCCF5                 :1;
        unsigned IOCCF6                 :1;
        unsigned IOCCF7                 :1;
    };
} IOCCFbits_t;
extern volatile IOCCFbits_t IOCCFbits __at(0x3A67);
// bitfield macros
#define _IOCCF_IOCCF0_POSN                                  0x0
#define _IOCCF_IOCCF0_POSITION                              0x0
#define _IOCCF_IOCCF0_SIZE                                  0x1
#define _IOCCF_IOCCF0_LENGTH                                0x1
#define _IOCCF_IOCCF0_MASK                                  0x1
#define _IOCCF_IOCCF1_POSN                                  0x1
#define _IOCCF_IOCCF1_POSITION                              0x1
#define _IOCCF_IOCCF1_SIZE                                  0x1
#define _IOCCF_IOCCF1_LENGTH                                0x1
#define _IOCCF_IOCCF1_MASK                                  0x2
#define _IOCCF_IOCCF2_POSN                                  0x2
#define _IOCCF_IOCCF2_POSITION                              0x2
#define _IOCCF_IOCCF2_SIZE                                  0x1
#define _IOCCF_IOCCF2_LENGTH                                0x1
#define _IOCCF_IOCCF2_MASK                                  0x4
#define _IOCCF_IOCCF3_POSN                                  0x3
#define _IOCCF_IOCCF3_POSITION                              0x3
#define _IOCCF_IOCCF3_SIZE                                  0x1
#define _IOCCF_IOCCF3_LENGTH                                0x1
#define _IOCCF_IOCCF3_MASK                                  0x8
#define _IOCCF_IOCCF4_POSN                                  0x4
#define _IOCCF_IOCCF4_POSITION                              0x4
#define _IOCCF_IOCCF4_SIZE                                  0x1
#define _IOCCF_IOCCF4_LENGTH                                0x1
#define _IOCCF_IOCCF4_MASK                                  0x10
#define _IOCCF_IOCCF5_POSN                                  0x5
#define _IOCCF_IOCCF5_POSITION                              0x5
#define _IOCCF_IOCCF5_SIZE                                  0x1
#define _IOCCF_IOCCF5_LENGTH                                0x1
#define _IOCCF_IOCCF5_MASK                                  0x20
#define _IOCCF_IOCCF6_POSN                                  0x6
#define _IOCCF_IOCCF6_POSITION                              0x6
#define _IOCCF_IOCCF6_SIZE                                  0x1
#define _IOCCF_IOCCF6_LENGTH                                0x1
#define _IOCCF_IOCCF6_MASK                                  0x40
#define _IOCCF_IOCCF7_POSN                                  0x7
#define _IOCCF_IOCCF7_POSITION                              0x7
#define _IOCCF_IOCCF7_SIZE                                  0x1
#define _IOCCF_IOCCF7_LENGTH                                0x1
#define _IOCCF_IOCCF7_MASK                                  0x80

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x3A6A);
#ifndef _LIB_BUILD
asm("RC3I2C equ 03A6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x3A6A);
// bitfield macros
#define _RC3I2C_TH_POSN                                     0x0
#define _RC3I2C_TH_POSITION                                 0x0
#define _RC3I2C_TH_SIZE                                     0x2
#define _RC3I2C_TH_LENGTH                                   0x2
#define _RC3I2C_TH_MASK                                     0x3
#define _RC3I2C_PU_POSN                                     0x4
#define _RC3I2C_PU_POSITION                                 0x4
#define _RC3I2C_PU_SIZE                                     0x2
#define _RC3I2C_PU_LENGTH                                   0x2
#define _RC3I2C_PU_MASK                                     0x30
#define _RC3I2C_SLEW_POSN                                   0x6
#define _RC3I2C_SLEW_POSITION                               0x6
#define _RC3I2C_SLEW_SIZE                                   0x1
#define _RC3I2C_SLEW_LENGTH                                 0x1
#define _RC3I2C_SLEW_MASK                                   0x40
#define _RC3I2C_TH0_POSN                                    0x0
#define _RC3I2C_TH0_POSITION                                0x0
#define _RC3I2C_TH0_SIZE                                    0x1
#define _RC3I2C_TH0_LENGTH                                  0x1
#define _RC3I2C_TH0_MASK                                    0x1
#define _RC3I2C_TH1_POSN                                    0x1
#define _RC3I2C_TH1_POSITION                                0x1
#define _RC3I2C_TH1_SIZE                                    0x1
#define _RC3I2C_TH1_LENGTH                                  0x1
#define _RC3I2C_TH1_MASK                                    0x2
#define _RC3I2C_PU0_POSN                                    0x4
#define _RC3I2C_PU0_POSITION                                0x4
#define _RC3I2C_PU0_SIZE                                    0x1
#define _RC3I2C_PU0_LENGTH                                  0x1
#define _RC3I2C_PU0_MASK                                    0x10
#define _RC3I2C_PU1_POSN                                    0x5
#define _RC3I2C_PU1_POSITION                                0x5
#define _RC3I2C_PU1_SIZE                                    0x1
#define _RC3I2C_PU1_LENGTH                                  0x1
#define _RC3I2C_PU1_MASK                                    0x20
#define _RC3I2C_I2CTH_POSN                                  0x0
#define _RC3I2C_I2CTH_POSITION                              0x0
#define _RC3I2C_I2CTH_SIZE                                  0x2
#define _RC3I2C_I2CTH_LENGTH                                0x2
#define _RC3I2C_I2CTH_MASK                                  0x3
#define _RC3I2C_I2CPU_POSN                                  0x4
#define _RC3I2C_I2CPU_POSITION                              0x4
#define _RC3I2C_I2CPU_SIZE                                  0x2
#define _RC3I2C_I2CPU_LENGTH                                0x2
#define _RC3I2C_I2CPU_MASK                                  0x30
#define _RC3I2C_I2CSLEW_POSN                                0x6
#define _RC3I2C_I2CSLEW_POSITION                            0x6
#define _RC3I2C_I2CSLEW_SIZE                                0x1
#define _RC3I2C_I2CSLEW_LENGTH                              0x1
#define _RC3I2C_I2CSLEW_MASK                                0x40
#define _RC3I2C_I2CTH0_POSN                                 0x0
#define _RC3I2C_I2CTH0_POSITION                             0x0
#define _RC3I2C_I2CTH0_SIZE                                 0x1
#define _RC3I2C_I2CTH0_LENGTH                               0x1
#define _RC3I2C_I2CTH0_MASK                                 0x1
#define _RC3I2C_I2CTH1_POSN                                 0x1
#define _RC3I2C_I2CTH1_POSITION                             0x1
#define _RC3I2C_I2CTH1_SIZE                                 0x1
#define _RC3I2C_I2CTH1_LENGTH                               0x1
#define _RC3I2C_I2CTH1_MASK                                 0x2
#define _RC3I2C_I2CPU0_POSN                                 0x4
#define _RC3I2C_I2CPU0_POSITION                             0x4
#define _RC3I2C_I2CPU0_SIZE                                 0x1
#define _RC3I2C_I2CPU0_LENGTH                               0x1
#define _RC3I2C_I2CPU0_MASK                                 0x10
#define _RC3I2C_I2CPU1_POSN                                 0x5
#define _RC3I2C_I2CPU1_POSITION                             0x5
#define _RC3I2C_I2CPU1_SIZE                                 0x1
#define _RC3I2C_I2CPU1_LENGTH                               0x1
#define _RC3I2C_I2CPU1_MASK                                 0x20

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x3A6B);
#ifndef _LIB_BUILD
asm("RC4I2C equ 03A6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x3A6B);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x1
#define _RC4I2C_SLEW_LENGTH                                 0x1
#define _RC4I2C_SLEW_MASK                                   0x40
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_PU0_POSN                                    0x4
#define _RC4I2C_PU0_POSITION                                0x4
#define _RC4I2C_PU0_SIZE                                    0x1
#define _RC4I2C_PU0_LENGTH                                  0x1
#define _RC4I2C_PU0_MASK                                    0x10
#define _RC4I2C_PU1_POSN                                    0x5
#define _RC4I2C_PU1_POSITION                                0x5
#define _RC4I2C_PU1_SIZE                                    0x1
#define _RC4I2C_PU1_LENGTH                                  0x1
#define _RC4I2C_PU1_MASK                                    0x20
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CPU_POSN                                  0x4
#define _RC4I2C_I2CPU_POSITION                              0x4
#define _RC4I2C_I2CPU_SIZE                                  0x2
#define _RC4I2C_I2CPU_LENGTH                                0x2
#define _RC4I2C_I2CPU_MASK                                  0x30
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x1
#define _RC4I2C_I2CSLEW_LENGTH                              0x1
#define _RC4I2C_I2CSLEW_MASK                                0x40
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CPU0_POSN                                 0x4
#define _RC4I2C_I2CPU0_POSITION                             0x4
#define _RC4I2C_I2CPU0_SIZE                                 0x1
#define _RC4I2C_I2CPU0_LENGTH                               0x1
#define _RC4I2C_I2CPU0_MASK                                 0x10
#define _RC4I2C_I2CPU1_POSN                                 0x5
#define _RC4I2C_I2CPU1_POSITION                             0x5
#define _RC4I2C_I2CPU1_SIZE                                 0x1
#define _RC4I2C_I2CPU1_LENGTH                               0x1
#define _RC4I2C_I2CPU1_MASK                                 0x20

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0x3A70);
#ifndef _LIB_BUILD
asm("ANSELD equ 03A70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELD0                :1;
        unsigned ANSELD1                :1;
        unsigned ANSELD2                :1;
        unsigned ANSELD3                :1;
        unsigned ANSELD4                :1;
        unsigned ANSELD5                :1;
        unsigned ANSELD6                :1;
        unsigned ANSELD7                :1;
    };
} ANSELDbits_t;
extern volatile ANSELDbits_t ANSELDbits __at(0x3A70);
// bitfield macros
#define _ANSELD_ANSELD0_POSN                                0x0
#define _ANSELD_ANSELD0_POSITION                            0x0
#define _ANSELD_ANSELD0_SIZE                                0x1
#define _ANSELD_ANSELD0_LENGTH                              0x1
#define _ANSELD_ANSELD0_MASK                                0x1
#define _ANSELD_ANSELD1_POSN                                0x1
#define _ANSELD_ANSELD1_POSITION                            0x1
#define _ANSELD_ANSELD1_SIZE                                0x1
#define _ANSELD_ANSELD1_LENGTH                              0x1
#define _ANSELD_ANSELD1_MASK                                0x2
#define _ANSELD_ANSELD2_POSN                                0x2
#define _ANSELD_ANSELD2_POSITION                            0x2
#define _ANSELD_ANSELD2_SIZE                                0x1
#define _ANSELD_ANSELD2_LENGTH                              0x1
#define _ANSELD_ANSELD2_MASK                                0x4
#define _ANSELD_ANSELD3_POSN                                0x3
#define _ANSELD_ANSELD3_POSITION                            0x3
#define _ANSELD_ANSELD3_SIZE                                0x1
#define _ANSELD_ANSELD3_LENGTH                              0x1
#define _ANSELD_ANSELD3_MASK                                0x8
#define _ANSELD_ANSELD4_POSN                                0x4
#define _ANSELD_ANSELD4_POSITION                            0x4
#define _ANSELD_ANSELD4_SIZE                                0x1
#define _ANSELD_ANSELD4_LENGTH                              0x1
#define _ANSELD_ANSELD4_MASK                                0x10
#define _ANSELD_ANSELD5_POSN                                0x5
#define _ANSELD_ANSELD5_POSITION                            0x5
#define _ANSELD_ANSELD5_SIZE                                0x1
#define _ANSELD_ANSELD5_LENGTH                              0x1
#define _ANSELD_ANSELD5_MASK                                0x20
#define _ANSELD_ANSELD6_POSN                                0x6
#define _ANSELD_ANSELD6_POSITION                            0x6
#define _ANSELD_ANSELD6_SIZE                                0x1
#define _ANSELD_ANSELD6_LENGTH                              0x1
#define _ANSELD_ANSELD6_MASK                                0x40
#define _ANSELD_ANSELD7_POSN                                0x7
#define _ANSELD_ANSELD7_POSITION                            0x7
#define _ANSELD_ANSELD7_SIZE                                0x1
#define _ANSELD_ANSELD7_LENGTH                              0x1
#define _ANSELD_ANSELD7_MASK                                0x80

// Register: WPUD
#define WPUD WPUD
extern volatile unsigned char           WPUD                __at(0x3A71);
#ifndef _LIB_BUILD
asm("WPUD equ 03A71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUD0                  :1;
        unsigned WPUD1                  :1;
        unsigned WPUD2                  :1;
        unsigned WPUD3                  :1;
        unsigned WPUD4                  :1;
        unsigned WPUD5                  :1;
        unsigned WPUD6                  :1;
        unsigned WPUD7                  :1;
    };
} WPUDbits_t;
